Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེ་ནས་དེ་མཐར་གྱིས་རྒྱུ་ཞིང་སོང་སོང་བ་ལས། ཡུལ་གྱེན་དུ་རྒྱལ་དུ་ཕྱིན་ཏེ།
en: They made their way, traveling and traveling, until they eventually arrived in the land of Ujjayinī.

source: དེ་དེར་ཕྱིན་ནས་རྒྱལ་པོ་གཏུམ་པོ་རབ་སྣང་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་ཞུགས་པར་བྱས་སོ། །
en: There he led King Caṇḍapradyota to take up the doctrine of the Buddha.

source: ཡུལ་དཔའ་རབ་ཏུ་སོང་ནས། རྒྱལ་པོ་འཆར་ཀ་དད་པ་ཕུན་སུམ་ཚོགས་པ་ལ་གནས་པར་བྱས་སོ། །
en: Then he traveled to Vatsa and led King Udayana to dwell in sublime faith.

source: སྐྱེ་བོ་ཕལ་པོ་ཆེ་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་དད་པར་བྱས་སོ། །
en: He brought many to faith in the doctrine of the Blessed One.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཡུལ་དཔའ་རབ་ཀྱི་རྒྱལ་པོ་འཆར་ཀའི་བཙུན་མོ་ལ་བུ་ཆགས་ནས། དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་། བུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ཏེ།
en: One day King Udayana of Vatsa’s queen conceived, and after nine or ten months had passed she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས། མིང་ས་ར་ན་ཞེས་བཏགས་སོ། །
en: At the elaborate feast celebrating his birth they named him Saraṇa.

source: དེ་ནས་ཁྱེའུ་ས་ར་ན་འོ་མ་དང་། ཞོ་དང་། མར་དང་། ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ།
en: They reared young Saraṇa on milk, yogurt, butter, ghee, and milk solids,

source: མཚོའི་ནང་གི་པད་མ་བཞིན་དུ་སྐུ་དྲག་པར་གྱུར་ཏོ། །
en: and he flourished like a lotus in a lake.

source: དེ་ནས་དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ། ཁྱེའུ་དེ་ཡི་གེ་སློབ་ཏུ་བཅུག་སྟེ། རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་རྣམས་ཀྱི་བཟོའི་གནས་དང་། ལས་ཀྱི་གནས་ཐ་དད་པ་འདི་ལྟ་སྟེ། གླང་པོ་ཆེ་ཞོན་པ་དང་། རྟ་ཞོན་པ་དང་། མཚོན་ཆ་བཅང་བ་དང་། འཕོང་དང་། མདུན་དུ་བསྣུར་བ་དང་། ཕྱིར་བསྣུར་བ་དང་། གཡུལ་ལས་ཐར་བར་བྱ་བ་དང་། ལྕགས་ཀྱུས་གཟུང་བ་དང་། ཞགས་པས་གཟུང་བ་དང་། མདའ་བོ་ཆེ་འཕང་བ་དང་། རྡོ་རྗེ་རྩེ་གཅིག་པ་འཕང་བ་དང་། མཚོན་རྩེ་གཅིག་པ་གདབ་པ་དང་། འཁོར་ལོ་འཕང་བ་དང་། གཅད་པ་དང་། གཤེག་པ་དང་། ལག་པས་གཟུང་བ་དང་། རྐང་པའི་སྟབས་དང་། མགོ་བོ་བསྐྱབ་པ་དང་། རྒྱང་མར་འཕོག་པ་དང་། སྒྲ་གྲག་པར་འཕོག་པ་དང་། གནད་དུ་འཕོག་པ་དང་། གདོན་མི་ཟ་བར་འཕོག་པར་བྱ་བ་དང་། ཚབས་ཆེར་གཏང་བ་རྣམས་ཀྱང་བསླབས་ནས་གནས་ལྔ་ལ་བྱང་བར་གྱུར་ཏོ། །
en: As he grew up, they made him study letters, and trained him in all the different fields of craft and skill in which duly consecrated rulers of the royal caste train, such as how to ride an elephant, how to ride horseback, how to wield a weapon, and how to shoot an arrow, advance, retreat, wage war, grasp with an iron hook, wield a lasso, shoot a spear, throw a single-pointed vajra, throw other single-pointed weapons, and throw a disk; how to cut, cleave, grapple and hold, employ footwork, guard one’s head, strike from a distance, and strike at the noise of an unseen enemy; and how to target the vital points, take infallible aim, and maximize damage. By the time he had been educated in all of these, he was learned in the five fields of knowledge.

source: དེ་ནས་ཕྱི་ཞིག་ན་གཞོན་ནུ་ས་ར་ན་ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱ་ཡ་ནའི་བུ་ལས་བརྟེན་ནས།
en: One day young Saraṇa entrusted himself to Venerable Kātyāyanaputra,

source: བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་དད་པ་རྙེད་དེ།
en: found faith in the teaching of the Blessed One,

source: སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བླངས་སོ། །
en: went for refuge, and took the fundamental precepts.

source: དེ་ནས་དེས་བལྟས་ན་ཕ་ཆོས་དང་ཆོས་མ་ཡིན་པས་རྒྱལ་པོ་བྱེད་པ་མཐོང་ངོ་། །དེ་ནས་དེས་བསམས་པ།
en: Then he came to see that his father administrated the affairs of the kingdom both righteously and unrighteously, and he thought,

source: ཡབ་ནོངས་པའི་འོག་ཏུ་ནི་བདག་རྒྱལ་སར་འཇུག་པར་འོངས་ཏེ།
en: “After my father’s death the throne will be ceded to me.

source: བདག་ལ་རྒྱལ་སྲིད་མི་དགོས་ཀྱིས།
en: I have no need for a kingdom.

source: བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ལ་ཆུ་བོ་རྣམས་ལས་བརྒལ་བར་བྱ་བ་དང་། སྦྱོར་བ་རྣམས་ལས་འདའ་བར་བྱ་བའི་ཕྱིར། བརྩོན་པ་དང་། བསྒྲུབ་པ་དང་། འབད་པར་བྱའོ་
en: Instead, I will go forth in the doctrine of the Blessed One in order to ford the floodwaters and completely escape my fetters with diligence, practice, and effort.”

source: སྙམ་ནས་ཡབ་ཡུམ་ལ་གསོལ་ཏེ
en: With this thought he asked for his parents’ permission,

source: ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱ་ཡ་ནའི་བུའི་ཐད་དུ་རབ་ཏུ་བྱུང་སྟེ། བསྙེན་པར་རྫོགས་སོ། །
en: went forth as a novice in the presence of Venerable Kātyāyanaputra, and received full ordination.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱ་ཡ་ནའི་བུས་བསམས་པ།
en: Venerable Kātyāyanaputra thought,

source: ཡུལ་འདི་ནས་བཀར་དགོས་སོ་སྙམ་ནས། དེ་ཁྲིད་དེ་ཡུལ་གྱེན་དུ་རྒྱལ་དུ་སོང་ནས་དེ་ན་འཁོད་དོ། །
en: “He should leave this country,” and led him to settle down in Ujjayinī.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཚེ་དང་ལྡན་པ་ས་ར་ན་སྔ་དྲོ་ཆོས་གོས་དང་། ཤམ་ཐབས་གྱོན་ཏེ། ལྷུང་བཟེད་ཐོགས་ནས་གྲོང་ཁྱེར་གྱེན་དུ་རྒྱལ་དུ་བསོད་སྙོམས་ལ་སོང་ངོ་། །
en: One morning, Venerable Saraṇa donned his lower garment and Dharma robes, and, carrying his alms bowl, went for alms in the city of Ujjayinī.

source: དེ་ཡང་སྤྱོད་ཡུལ་རྒྱུས་མི་ཤེས་ལ་ལམ་པོ་ཆེ་དང་སྲང་གི་རྒྱུས་ལ་མི་མཁས་པ་ཞིག་སྟེ།
en: He did not know his way around the area, nor was he very familiar with the streets and thoroughfares.

source: དེ་མཐར་གྱིས་བསོད་སྙོམས་རྒྱུ་ཞིང་སོང་སོང་བ་ལས། རྒྱལ་པོ་གཏུམ་པོ་རབ་སྣང་གི་ཕོ་བྲང་གི་ཆབ་སྒོར་ཕྱིན་ནས་
en: As he went for alms he eventually came to the main gate of King Caṇḍapradyota’s palace,

source: ཆབ་སྒོ་བ་རྣམས་མེད་པའི་སྐབས་སུ་དེ་རྒྱལ་པོའི་ཕོ་བྲང་གི་ནང་དུ་སོང་ནས
en: and it so happened that the gatekeeper was not there.

source: དེ་རྒྱལ་པོའི་བཙུན་མོ་རྣམས་ཀྱིས་མཐོང་ན། གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་ཏེ། ལུས་ཀྱི་ཤ་རྒྱས་པར་འདུག་གོ། །
en: He entered the palace, and the royal queens saw his fine form, elegant and muscular.

source: དེ་ནས་དེ་མཐོང་མ་ཐག་ཏུ་དེ་དག་དེ་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏེ། དེ་དག་གིས་བསམས་པ།
en: At the sight of him they experienced a surge of joy and thought,

source: དགེ་སློང་འདི་འདི་ལྟར་གཟུགས་བཟང་ཞིང་མཛེས་ལ་ན་གཞོན་ལ། ཚངས་པར་སྤྱོད་པ་ལ་ཡང་གནས་སོ་སྙམ་མོ། །
en: “What a finely formed, elegant, muscular young monk, upholding the holy life!”

source: དེ་ནས་དེ་དག་དགའ་བར་གྱུར་པས་དེའི་སྟན་བཤམས་ཏེ་འདུག་ཏུ་བཅུག་ནས། བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོས་ཚིམ་པར་བྱས་ནས།
en: In their joy they prepared a seat, invited him to sit there, and contented him with many good, wholesome foods.

source: ཚེ་དང་ལྡན་པ་ས་ར་ན་བསྐོར་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་གུང་ལ་བཞག་གོ། །
en: Then they gathered around Venerable Saraṇa and placed him in the middle to listen to the Dharma.

source: དེ་ནས་དེ་དེ་ན་འདུག་པའི་སྐབས་སུ་རྒྱལ་པོ་གཏུམ་པོ་རབ་སྣང་བཙུན་མོའི་འཁོར་དུ་འོངས་སོ། །
en: As he was sitting there, King Caṇḍapradyota came to see his retinue of queens.

source: བཙུན་མོ་རྣམས་ཀྱི་ལུགས་ཀྱིས་ན་གང་གི་ཚེ། རྒྱལ་པོ་བཙུན་མོའི་འཁོར་དུ་འོང་བ་དེའི་ཚེ། ལངས་ཏེ་བསུར་འགྲོ་བ་ཡིན་ན་
en: Now when the king enters their midst it is customary for his queens to rise to receive him,

source: དེ་རྣམས་ཆོས་ཉན་པ་ལས་འདུན་ཆེས་ནས་ལྡང་བ་དང་བསུ་བ་ཡང་མ་བྱས་སོ། །
en: but because they so much enjoyed listening to the Dharma, they neither rose nor greeted him.

source: དེ་ནས་རྒྱལ་པོ་གཏུམ་པོ་རབ་སྣང་གིས་བསམས་པ།
en: At this King Caṇḍapradyota wondered,

source: མ་ལ་བདག་བཙུན་མོ་རྣམས་ཀྱིས་མ་བསུ་བ་འདི་ཅི་ལས་གྱུར་སྙམ་ནས།
en: “What is this? Why do my queens not receive me?”

source: རྒྱལ་པོས་དེ་འཕྲིགས་ཏེ། ཁྲོས་བཞིན་དུ་བཙུན་མོའི་འཁོར་དུ་སོང་ངོ་། །
en: The king became suspicious and approached his retinue of queens in anger.

source: དེ་དེར་སོང་སྟེ་བལྟས་ན་ཚེ་དང་ལྡན་པ་ས་ར་ན་བཙུན་མོ་རྣམས་ཀྱིས་བསྐོར་བ་མཐོང་ནས། རྒྱལ་པོ་དེ་ལྷག་པར་ཡང་ཁྲོ་བའི་ཀུན་ནས་དཀྲིས་པ་སྐྱེས་ཏེ།
en: He looked about, saw Venerable Saraṇa there, surrounded by the queens, and bristled with rage.

source: དེ་ཁྲོས་ནས་བསམས་པ།
en: In his anger he thought,

source: དགེ་སློང་གིས་ངའི་ཆུང་མ་མཐོང་གིས་མེད་དོ་སྙམ་མོ། །
en: “This monk is ogling my wives, that’s why they’re not receiving me!”

source: དེ་ནས་དེས་བསམ་པ།
en: Then he thought,

source: རེ་ཞིག་འདི་འདོད་ཆགས་དང་བྲལ་བ་ཡིན་ནམ། འོན་ཏེ་འདོད་ཆགས་དང་མ་བྲལ་བ་ཡིན་བརྟག་པར་བྱའོ་སྙམ་སྟེ།
en: “I will watch a while and see whether he is he rid of lust.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ས་ར་ན་ལ་སྨྲས་པ། ཅི་ཁྱོད་དགྲ་བཅོམ་པ་ཡིན་ནམ།
en: Thereupon he inquired of Venerable Saraṇa, “Tell me, are you an arhat?”

source: དེས་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་མ་ཡིན་ནོ། །
en: “No, Great King, I am not,” he replied.

source: རྒྱལ་པོས་སྨྲས་པ། ཅི་ཁྱོད་ཕྱིར་མི་འོང་བ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་རྒྱུན་དུ་ཞུགས་པ་ཐོབ་པ་ཡིན་ནམ།
en: “Tell me,” the king continued, “have you attained the resultant state of non-return, or once-return, or stream entry?

source: འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་དང་། ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཐོབ་པ་ཡིན་ནམ།
en: Have you attained the sphere of absorption of neither discrimination nor non-discrimination, the sphere of absorption of nothingness, the sphere of absorption of infinite consciousness, and the sphere of absorption of infinite space?

source: བསམ་གཏན་བཞི་པ་དང་། གསུམ་པ་དང་། གཉིས་པ་དང་། བསམ་གཏན་དང་པོ་ཐོབ་པ་ཡིན་ནམ།
en: Have you attained the fourth absorption? The third? The second? Or the first?”

source: དེས་སྨྲས་པ་རྒྱལ་པོ་ཆེན་པོ་མ་ཡིན་ནོ། །
en: “No, Great King, I have not,” he replied.

source: དགེ་སློང་འདི་འདོད་ཆགས་དང་བྲལ་བ་མ་ཡིན་ལ།
en: “This monk is not rid of lust.

source: འདི་མཁན་པོ་དང་སློབ་དཔོན་གྱིས་མ་བསླབས་ཀྱིས་ངས་འདི་བསླབ་པར་བྱའོ་སྙམ་ནས།
en: He has not trained under a preceptor nor under a spiritual master. I shall train him, then!”

source: ཞམ་རིང་བ་རྣམས་བོས་ཏེ་དེ་ལྕག་གིས་ཞེན་པར་བཞུས་ཏེ་བཏང་ངོ་། །
en: And he summoned his personal attendants, who lashed the monk viciously before letting him go.

source: དེ་ནས་དེ་ལྕག་གིས་བཞུས་པས་པགས་པ་རལ་ནས་
en: His skin lacerated from the lashing,

source: ཁྲོས་ཏེ་བསམས་པ་བདག་མ་ཉེས་པར་དུས་ངན་པའི་རྒྱལ་པོ་གཏུམ་པོ་འདིས་བརྡེགས་ཀྱིས།
en: Venerable Saraṇa angrily thought, “I have been wrongly accused, and now this cruel king of this wicked age has thrashed me.

source: བདག་ཕའི་ཡུལ་དུ་སོང་ལ་ཕའི་ཡུལ་དུ་འདུག་སྟེ
en: I must go now and stay in my father’s country.

source: དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ཏེ་སོང་ལ། དུས་ངན་པའི་རྒྱལ་པོ་གཏུམ་པོ་འདི། རྡུལ་བཏོན་ཏེ་བཏང་ངོ་སྙམ་ནས།
en: There I shall array the four divisions of his army to rout this cruel king of this wicked age and trample him to dust.”

source: ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱ་ཡ་ནའི་བུ་ག་ལ་འདུག་པ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: He went to see Venerable Kātyāyanaputra.

source: ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱ་ཡ་ནའི་བུའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ། སྨྲས་པ།
en: Upon his arrival he bowed down at Venerable Kātyāyanaputra’s feet and told him,

source: མཁན་པོ་བདག་མ་ནོངས་པར་དུས་ངན་པའི་རྒྱལ་པོ་གཏུམ་པོ་དེས། བདག་མ་ཉེས་པར་བརྡེགས་པས་ན་
en: “My preceptor, I have been wrongly accused and thrashed by a cruel king of this wicked age.

source: བདག་ཕ་མའི་ཡུལ་དུ་མཆིས་ཏེ། དེར་མཆིས་ནས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ཏེ་མཆིས་ལ། དུས་ངན་པའི་རྒྱལ་པོ་གཏུམ་པོ་དེ་རྡུལ་བཏོན་ཏེ་བཏང་གིས།
en: I shall now go to my parents, and when I get there I will array the four divisions of my father’s army to rout this cruel king of this wicked age and trample him to dust.

source: བསླབ་པའི་གཞི་རྣམས་བཞེས་སུ་གསོལ།
en: Therefore, I am requesting to give back my precepts.”

source: གནས་བརྟན་གྱིས་སྨྲས་པ། བུ་ཁྲོ་བའི་དབང་དུ་མ་འགྲོ་ཤིག །
en: “Child,” replied the elder monk, “don’t fall under the sway of anger.

source: བཅོམ་ལྡན་འདས་ཀྱིས་རབ་ཏུ་བྱུང་བས་ནི། འཇིག་རྟེན་གྱི་ཆོས་བརྒྱད་དེ། རྙེད་པ་དང་། མ་རྙེད་པ་དང་། གྲགས་པ་དང་། གྲགས་པ་མ་ཡིན་པ་དང་། བསྟོད་པ་དང་། སྨད་པ་དང་། བདེ་བ་དང་། སྡུག་བསྔལ་བ་ཐམས་ཅད་བཟོད་པར་བྱའོ་ཞེས་མ་གསུངས་སམ་ཞེས་བྱས་ཏེ
en: Did the Blessed One not state that renunciants should meet with forbearance these eight worldly concerns: gain and loss, fame and obscurity, praise and blame, and happiness and suffering?”

source: གནས་བརྟན་དེས་དེ་ལ་ལན་མང་དུ་བཀག་ཀྱང་དགག་མ་ནུས་ནས།
en: Three times the elder monk tried to stop him, but he was unable to do so.

source: ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱ་ཡ་ནའི་བུས་དེ་ལ་སྨྲས་པ།
en: So Venerable Kātyāyanaputra told him,

source: བུ་དེ་ལྟར་ཁྱོད་འགྲོ་འདོད་ན་ད་ལྟར་ནི་ནམ་སྲོས་སུ་ཉེ་སྟེ། ལམ་ན་སེང་གེ་དང་། སྟག་དང་། གཟིག་དང་། དྲེད་མོ་རྣམས་ཀྱི་འཇིགས་པ་ཡོད་ཀྱིས་དོ་ནུབ་ཀྱི་ཚེ་ལ་འདིར་འདུག་ལ་ནང་པར་སོང་ཤིག་ཅེས་བྱས་སོ། །
en: “If that’s the case, my boy, and you want to go, since it’s almost dark now and there is danger of lions, tigers, leopards, and bears on the path, stay here for the night. In the morning you can go.”

source: དེ་ནས་དེས་སྨྲས་པ། མཁན་པོས་ཅི་སྐད་བཀའ་སྩལ་པ་བཞིན་འཚལ་ལོ་ཞེས་བྱས་ནས།
en: “As you wish, preceptor,” he replied.

source: གནས་བརྟན་དེ་དེ་དང་གནས་ཁང་གཅིག་ཏུ་ཉལ་ཏེ། ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱ་ཡ་ནའི་བུས་དེ་བཟློག་པའི་ཕྱིར་དེས་བྱིན་གྱིས་བརླབས་ཏེ། ཅི་ནས་དེ་ཉལ་བའི་རྨི་ལམ་དུ་དེས་བསླབ་པ་ཕུལ་ཏེ།
en: As he was sleeping in the same dwelling as the elder monk, to stop him Venerable Kātyāyanaputra performed a miracle that caused him, as he slept, to dream he gave back his precepts,

source: ཕའི་ཡུལ་དུ་སོང་ནས་ཕས་དེའི་རྒྱལ་སྲིད་ལ་དབང་བྱེད་དུ་བཅུག་སྟེ།
en: then went to his father’s country and bid his father to let him rule the kingdom.

source: དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་བྱིན་ནས་འདི་སྐད་ཅེས་བསྒོ་སྟེ།
en: His father offered him the four divisions of his army and told him,

source: ཁྱོད་ཀྱིས་ཐོག་མ་ཁོ་ནར་ལས་སུ་བྱ་བ་ནི་དགྲ་ཚར་གཅོད་པར་གྱིས་ཤིག །ཅེས་བྱས་ནས།
en: “First exterminate your enemy.”

source: དེ་ཐོས་མ་ཐག་ཏུ་དེས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ནས། རྒྱལ་པོ་གཏུམ་པོ་རབ་སྣང་གི་ཡུལ་དུ་དམག་དྲངས་པ་ལས།
en: After hearing this, he immediately arrayed the four divisions of the army and led the soldiers into King Caṇḍapradyota’s country.

source: རྒྱལ་པོ་གཏུམ་པོ་རབ་སྣང་གིས་དེའི་གཡུལ་ཕམ་པར་བྱས་ཏེ། ཐུབ་པར་བྱས་ནས། རྒྱབ་ཀྱིས་ཕྱོགས་པར་བྱས་ཏེ།
en: But King Caṇḍapradyota defeated him in battle, overcame him and put him to flight,

source: གསོན་པོར་བཟུང་ནས་གསོད་དུ་བཏང་སྟེ།
en: and then captured him alive and sent him to be executed.

source: དེ་ནས་གཤེད་མའི་མི་རྣམས་ཀྱིས་ཁྲིད་དེ་
en: The executioners led him away,

source: གསོད་པའི་སར་ཕྱིན་དུ་ཉེ་བ་དང་། དེས་བལྟས་ན་རྨི་ལམ་ཉིད་ན་ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱ་ཡ་ནའི་བུ་གྲོང་ཁྱེར་གྱེན་དུ་རྒྱལ་ན་བསོད་སྙོམས་བྱེད་ཅིང་འདུག་པ་མཐོང་ནས་དེས་ཀུས་བཏབ་སྟེ
en: and as they neared the spot where he was to be executed, in the dream he looked about him, saw Venerable Kātyāyanaputra going for alms in the city of Ujjayinī, and shouted,

source: མཁན་པོ་བདག་གི་སྐྱབས་མཛད་དུ་གསོལ།
en: “Preceptor, please protect me!

source: བདག་ལ་དཀའ་བ་མཛད་པ་དང་། སྲོག་ཕངས་པ་སྦྱིན་པར་མཛད་དུ་གསོལ།
en: Please take on the difficult task of saving my precious life!”

source: དེ་ནས་དེ་དེས་སྐྲག་ནས་སད་ཀྱང་རྨི་ལམ་ལ་ཡང་དག་པ་ཙམ་དུ་འཛིན་ཅིང་དེ་བཞིན་དུ་རྡོལ་ནས།
en: He awoke still terrified and sprang up, believing that what he dreamt had really taken place.

source: བུ་ཁྱོད་ཀྱིས་རྨི་ལམ་མཐོང་བར་ཟད་ཀྱིས་མ་འཇིགས་ཤིག །
en: “Son, what you saw was just a dream. Don’t be afraid.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ས་ར་ན་དགའ་བར་གྱུར་ནས་སེམས་པ་ལ་ཞུགས་ཏེ
en: Saraṇa was immediately relieved to hear this, and he started to think,

source: ས་ར་ན་ཞེས་བྱ་བ་དེ་ནི་ང་ཉིད་ཡིན་ཞིང་འདུག་ལ།
en: “It’s the ‘me’ that is here that is Saraṇa.

source: བདག་གིས་ནི་སེམས་ཅན་གཅིག་ལ་ཡང་འཚེ་བ་མ་བྱས་ན།
en: I haven’t harmed a single being.

source: ད་བདག་ཁྲོ་བའི་དབང་དུ་སོང་སྟེ། རྨི་ལམ་དུ་ཡང་སྐྱེ་བོ་མང་པོ་དེ་སྙེད་བསད་ཀྱིས།
en: Under the sway of anger I would kill many, even in my dreams.

source: དོན་དུ་གཉེར་བ་འདི་ལྟ་བུ་བདག་གིས་བཏང་ངོ་སྙམ་མོ། །
en: I will give up all such ambitions.”

source: དེ་ནས་གནས་བརྟན་གྱིས་དེའི་ཡིད་སྐྱོ་བར་གྱུར་པར་རིག་ནས། དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: Then the elder monk, recognizing his disillusionment, taught him the Dharma accordingly.

source: དེས་ན་ས་ར་ནས་སྟན་དེ་ཉིད་ལ་འདུག་བཞིན་དུ་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: Saraṇa thus cast away all afflictive emotions and manifested arhatship right where he sat.

source: དེ་ནས་རྒྱལ་པོ་གཏུམ་པོ་རབ་སྣང་གིས་བདག་གིས་དགེ་སློང་ལྕག་གིས་བཞུས་པ་གང་ཡིན་པ་དེ། རྒྱལ་པོ་འཆར་ཀའི་བུ་ཡིན་ནོ་ཞེས་ཐོས་ནས།
en: King Caṇḍapradyota heard that the monk he had lashed was King Udayana’s son and came to see him.

source: དེའི་ཐད་དུ་སོང་སྟེ་རྐང་པ་ལ་ཕྱག་འཚལ་ནས་བཟོད་པ་གསོལ་ཏེ།
en: He bowed down at his feet, and begged his forgiveness.

source: དེ་ཉིད་ལས་བརྟེན་ནས་ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱ་ཡ་ནའི་བུ་ཞག་བདུན་གྱི་བར་དུ་བཤོས་ལ་སྤྱན་དྲངས་སོ། །
en: He entrusted himself to him, and invited Kātyāyanaputra to take his meal with him for seven days.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱ་ཡ་ནའི་བུས་བསམས་པ།
en: One day Venerable Kātyāyanaputra thought,

source: རྙེད་པ་དང་བཀུར་སྟི་སྐྱེས་ཀྱིས་བཅད་དགོས་སོ་སྙམ་ནས།
en: “I must rid myself of this worldly profit and acclaim,”

source: ཚེ་དང་ལྡན་པ་ས་ར་ན་དང་ལྷན་ཅིག་ཏུ་རྒྱལ་པོའི་ཁབ་ཏུ་སོང་ངོ་། །
en: so he went with Venerable Saraṇa to Rājagṛha.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ས་ར་ན་ཇི་ལྟར་གྱུར་པའི་སྐབས་དེ་དགེ་སློང་རྣམས་ཀྱིས་ཐོས་སོ། །
en: The monks heard what had happened to Venerable Saraṇa

source: ཐོས་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ།
en: and asked the Blessed One,

source: བཙུན་པ་ས་ར་ནས་ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ལགས།
en: “Lord, what action did Saraṇa take that ripened into his taking birth into a family of great means, prosperity, and wealth?

source: ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས། རྒྱལ་པོ་གཏུམ་པོ་རབ་སྣང་གིས་ལྕག་གིས་བཞུས་ལ།
en: What action did he take that ripened into his being lashed by King Caṇḍapradyota,

source: འདིས་བཅོམ་ལྡན་འདས་ཀྱང་མཉེས་པར་བགྱིས་ཏེམི་མཉེས་པར་མ་བགྱིས་ནས།
en: and that after that he pleased the Blessed One, did not displease him,

source: བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ།
en: went forth in the doctrine of the Blessed One,

source: ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས།
en: cast away all afflictive emotions,

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདི་ཉིད་ཀྱིས་ལས་བྱས་ཤིང་བསགས་ཏེ།
en: “Monks,” the Blessed One explained, “such are the actions that he committed and accumulated:

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན་རྒྱལ་པོ་ཚངས་པས་བྱིན་རྒྱལ་པོ་བྱེད་དོ། །
en: “Monks, in times gone by, King Brahmadatta reigned in the city of Vārāṇasī.

source: ཕྱི་ཞིག་ན་དེའི་བཙུན་མོའི་འཁོར་གྱིས་ཞམ་རིང་བྱས་ཏེ། སྐྱེད་མོས་ཚལ་གྱི་སར་སོང་བ་ལས་རྒྱལ་པོ་གཉིད་ཀྱིས་ལོག་གོ། །
en: One day, attended by his retinue of queens, he went into the gardens, where he fell asleep.

source: བུད་མེད་རྣམས་ནི་མེ་ཏོག་དང་། འབྲས་བུ་ལ་སྲེད་དེ། དེའི་བཙུན་མོ་རྣམས་སྐྱེད་མོས་ཚལ་དེར་ཕན་ཚུན་དུ་རྒྱུ་བ་ལ་ཞུགས་སོ། །
en: The women wandered here and there in the garden, their hearts set on finding flowers and fruit.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འཇིག་རྟེན་དུ་མི་འབྱུང་བ་དེའི་ཚེ། རང་སངས་རྒྱས་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་སྟེ།
en: “Now in times when a blessed one has not arisen in the world, the solitary buddhas appear.

source: རང་སངས་རྒྱས་ཞིག་སྐྱེད་མོས་ཚལ་དེར་མཚན་མོ་དགོངས་མལ་བཏབ་ནས།
en: So it was that a solitary buddha had bedded down in that garden for the night.

source: ལུས་མཛེས་པ་དང་། སེམས་མཛེས་པ་དེ་ལྟ་བུ་བུད་མེད་དེ་དག་གིས་མཐོང་ནས། མཐོང་མ་ཐག་ཏུ་དེ་ལ་སེམས་དགའ་བ་སྐྱེས་སོ། །
en: The women saw him there, elegant in body and elegant in mind, and felt a surge of joy at the sight of him.

source: དགའ་བ་སྐྱེས་ནས་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ། ཆོས་མཉན་པའི་ཕྱིར་མདུན་དུ་འཁོད་དོ། །
en: In their joy they bowed down at his feet and sat before him to listen to the Dharma.

source: དེ་ནས་རྒྱལ་པོ་དེ་སད་ནས། བཙུན་མོའི་འཁོར་མི་སྣང་ན།
en: “When the king awoke and his retinue of queens did not appear,

source: ཁྲོས་ཏེ་རལ་གྲི་རྣོན་པོ་ཐོགས་ནས། རྗེས་གར་བྱུང་བ་ཐོག་ཐག་ཏུ་སོང་བ་ལས།
en: he seethed with rage. The king took up a sharp sword and went to track them down.

source: རྒྱལ་པོ་དེས་རང་སངས་རྒྱས་དེ་བཙུན་མོའི་འཁོར་ལ་ཆོས་འཆད་ཅིང་འདུག་པ་མཐོང་ངོ་། །
en: He saw the solitary buddha expounding the Dharma to his retinue of queens

source: མཐོང་ནས་ཀྱང་དགེ་སློང་གིས་ངའི་ཆུང་མ་མཐོང་ངོ་སྙམ་སྟེ། དེ་ལྷག་པར་ཡང་ཁྲོ་བའི་ཀུན་ཏུ་དཀྲིས་པ་སྐྱེས་ནས།
en: and thought, ‘This monk is ogling my wives!’ and became even more enraged.

source: དེས་ཞམ་རིང་འཁོར་རྣམས་ལ་བསྒོ་སྟེ། རང་སངས་རྒྱས་དེ་ལྕག་གིས་ཞེན་པར་བཞུས་ཏེ་བཏང་ངོ་། །
en: He gave orders to his personal attendants, who lashed the solitary buddha viciously before letting him go.

source: ཉོན་མོངས་པ་འདི་ནི་སྨས་ཞིང་ཉམས་པར་གྱུར་ཏེ། འདི་གཏན་དུ་འཁྱམས་ན་མི་རུང་གིས་ར་མདའ་བྱ་དགོས་སོ་སྙམ་དུ་བསམས་ནས།
en: ‘It’s not right for this emotionally afflicted person, who has become so abased, to go on roaming forever. I have to help him.’

source: ནམ་མཁའ་ལ་འཕགས་ཏེ་འབར་བ་དང་། ལམ་མེར་འདུག་པ་དང་། ཆར་འབབ་པ་དང་། གློག་འགྱུ་བ་ལ་སོགས་པའི་ཆོ་འཕྲུལ་བསྟན་ནོ། །
en: So he rose up into the sky, making a miraculous display of fire and light, rain and lightning.

source: སོ་སོའི་སྐྱེ་བོ་རྣམས་ནི་རྫུ་འཕྲུལ་གྱིས་མྱུར་དུ་དད་པར་གྱུར་ཏེ།
en: “Ordinary people are quickly brought to faith by miracles.

source: དེ་མཐོང་མ་ཐག་ཏུ་དེ་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏེ།
en: The king thus felt a surge of joy at the sight of this,

source: དགའ་བར་གྱུར་ནས་སྡོང་པོ་སོག་ལེས་བཅད་པ་བཞིན་དུ་དེའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་སྨྲས་པ།
en: and in his joy he bowed down at the solitary buddha’s feet like a tree felled by a saw, saying,

source: སྐལ་བ་ཆེན་པོ་དང་ལྡན་པ་མར་སྤྱོན། བདག་ཉེས་པར་སྤྱོད་པའི་འདམ་དུ་བྱིང་བའི་ལག་ནས་དྲོངས་ཤིག་ཅེས་བྱས་སོ། །
en: ‘Oh great fortunate one, please, please come down. I am mired in misdeeds! Please reach down and lift me up!’

source: དེ་ནས་རང་སངས་རྒྱས་དེ་དེ་ཉིད་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་ས་ལ་བབས་ནས་དེས་དེའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ།
en: “Out of compassion for him, the solitary buddha descended, whereupon the king bowed down at his feet,

source: བཟོད་པར་གསོལ་ནས།
en: asked his forgiveness,

source: ཅི་སྲིད་འཚོའི་བར་དུ་ཡོ་བྱད་ཐམས་ཅད་བསྟབས་ཏེ།
en: and provided for his every need for as long as he lived.

source: སྐྱེད་མོས་ཚལ་དེ་ཉིད་དུ་ཡལ་ག་དང་ལོ་མ་རྣམས་ཀྱི་སྤྱིལ་པོ་ཕུབ་ནས། ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་སོ། །
en: There in the park he fashioned a hut of branches and leaves, and respectfully provided for his every need.

source: དེ་ནས་ཕྱི་ཞིག་ན་རང་སངས་རྒྱས་དེས་བསམས་པ།
en: “One day the solitary buddha thought,

source: བདག་ལ་ལུས་ཁོལ་བ་འདིས་ཅི་དགོས་ཀྱིས་བདག་ཞི་བ་མྱ་ངན་ལས་འདས་པའི་ཁམས་སུ་འགྲོ་བར་བྱའོ་
en: ‘What’s left to be done with this body? I will enter the realm of nirvāṇa.’

source: སྙམ་ནས་འབར་བ་དང་། ལམ་མེར་འདུག་པ་དང་། ཆར་འབབ་པ་དང་། གློག་འགྱུ་བའི་ཆོ་འཕྲུལ་བསྟན་ཏེཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: After reflecting in this way, he made a miraculous display of fire and light, rain and lightning, and passed into parinirvāṇa.

source: དེ་ནས་རྒྱལ་པོ་དེས་དེའི་སྐུ་གདུང་ལ་མཆོད་པ་བྱས་ནས།
en: “After that the king venerated his remains.

source: སྐུ་གདུང་གི་མཆོད་རྟེན་བརྩིགས་ཏེ། མཆོད་རྟེན་དེ་ལ་བསྙེན་བཀུར་ཆེན་པོ་བྱས་ནས་སྨོན་ལམ་བཏབ་པ།
en: He built a reliquary stūpa for the remains, made a large offering to the stūpa, and prayed,

source: ཀྱེ་མ་འདི་ལྟར་བདག་གིས་སེམས་ཅན་དག་པ་འདི་ལྟ་བུ་ལ་གནོད་པ་བྱས་པའི་ལས་འདི་བདག་གིས་མྱོང་བར་མ་གྱུར་ཅིག །
en: ‘May I not experience the results of the act of doing harm to such a pure being.

source: བདག་གིས་ཕྱིར་ཡང་བཀུར་སྟི་བྱས་པའི་དགེ་བའི་རྩ་བ་འདིས་ན། བདག་གང་དང་གང་དུ་སྐྱེ་བར་འགྱུར་བ། དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་ཤོག་ཤིག །
en: By the root of virtue of having paid homage to him, wherever I am born, may it be into a family of great means, prosperity, and wealth.

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: Going forth in his doctrine alone may I cast away all afflictive emotions, and manifest arhatship.’

source: དེའི་ཚེ་རྒྱལ་པོ་ཚངས་པས་བྱིན་ཞེས་བྱ་བར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ས་ར་ན་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was King Brahmadatta then is none other than Saraṇa.

source: དེས་དེར་རང་སངས་རྒྱས་ལ་གནོད་པ་བྱས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ལུས་ལ་ལྕག་གིས་བཞུས་པས་ལྕག་འོག་ཏུ་ཤི་ནས
en: The act of harming the solitary buddha ripened such that wherever he was born, his body was lashed until he died.

source: འདིས་རང་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་བས་ཀྱང་ཆེས་ཁྱད་པར་དུ་འཕགས་པ་ང་ལྟ་བུ་མཉེས་པར་བྱས་ཏེ།
en: “I am more exalted than even one hundred billion solitary buddhas,

source: མི་མཉེས་པར་མ་བྱས་ལ་ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: and now he has pleased me, and not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.
